Tekla Open API Reference for Tekla Structures 2025
BasePoint.ConvertFromBasePoint Method
Overload List
Name | Description
ConvertFromBasePoint(Point)
 Converts the given point from this base point to local point.
ConvertFromBasePoint(BasePoint, Point)
 Converts the given base point point to local point.
Top
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace